Notebook.org
#+TITLE: QuarkSuite DSL (v0.1.0)

* Table of Contents :TOC@5:
- [[#summary][Summary]]
- [[#api][API]]
  - [[#entry-point][Entry Point]]
  - [[#elements][Elements]]
    - [[#color][Color]]
      - [[#color-element-setup][Color Element Setup]]
      - [[#color-defn][=<color-defn>=]]
        - [[#color-defn-implementation][=<color-defn>= Implementation]]
      - [[#color-vision][=<color-vision>=]]
        - [[#color-vision-implementation][=<color-vision>= Implementation]]
      - [[#color-contrast][=<color-contrast>=]]
        - [[#color-contrast-implementation][=<color-contrast>= Implementation]]
      - [[#color-illuminant][=<color-illuminant>=]]
        - [[#color-illuminant-implementation][=<color-illuminant>= Implementation]]
      - [[#color-dict][=<color-dict>=]]
        - [[#color-dict-implementation][=<color-dict>= Implementation]]
  - [[#library][Library]]
    - [[#preamble][Preamble]]
    - [[#dsl-setup][DSL Setup]]
      - [[#workspace][Workspace]]
    - [[#color-1][Color]]
      - [[#color-setup][Color Setup]]
      - [[#mixins][Mixins]]
      - [[#data][Data]]
        - [[#colortoken][ColorToken]]
        - [[#palettetoken][PaletteToken]]
      - [[#definition][Definition]]
        - [[#colordefn][ColorDefn]]
      - [[#functions][Functions]]
        - [[#colorvision][ColorVision]]
        - [[#colorcontrast][ColorContrast]]
        - [[#colorilluminant][ColorIlluminant]]
      - [[#output][Output]]
        - [[#colordict][ColorDict]]

* Summary

This document is my scratchpad/workspace for QuarkSuite's new and experimental DSL (domain specific language).

Somewhat unconventionally, it's a DSL built on web components. The elements defined in this project work as a kind of
translation layer for the functionality of Core v2.

The aim is a *declarative workflow* through HTML that allows you to translate data generated from the core and also
transmit data to the core.

This is a work in progress I'm developing in conjunction with the refactor and enhancements of Core v2. This is
because they're interoperable and /must/ speak the same data language as each other to network seamlessly.

If you want to see the work I'm doing on QuarkSuite Core v2, you can [[https://github.com/quarksuite/core/tree/v2-workspace][check out its progress at its own repo]].

* API

** Entry Point

If you want to pull the whole DSL in, you can use the =mod.js= entry
point. Otherwise, import your desired modules directly.

#+BEGIN_SRC js :tangle "./mod.js" :comments link
import "./color.js";
#+END_SRC

** Elements

The elements listed below have at the least reached proof of concept status. This means they are usable, but expect bugs
and occasional odd behavior.

As stated above, I'm implementing them in tandem with Core v2's development. You should /not/ use these in production at
this point.

In addition, there is not much documentation at this stage. The DSL workflow itself is still up in the air, but
hopefully I've provided enough information for the bold and curious to go on.

*** Color
:PROPERTIES:
:header-args:js: :tangle "./color.js" :mkdirp yes :comments link
:END:

**** Color Element Setup

#+BEGIN_SRC js
import {
  ColorContrast,
  ColorDefn,
  ColorDict,
  ColorIlluminant,
  ColorToken,
  ColorVision,
  PaletteToken,
} from "./lib/color.js";

customElements.define("color-token", ColorToken);
customElements.define("palette-token", PaletteToken);

// Export components for custom naming

// Add init function to invoke internals when setting custom names
export function init() {
  customElements.define("color-token", ColorToken);
  customElements.define("palette-token", PaletteToken);
}

export { ColorContrast, ColorDefn, ColorDict, ColorIlluminant, ColorVision };
#+END_SRC

**** =<color-defn>=

***** =<color-defn>= Implementation

#+BEGIN_SRC js
customElements.define("color-defn", ColorDefn);
#+END_SRC

**** =<color-vision>=

***** =<color-vision>= Implementation

#+BEGIN_SRC js
customElements.define("color-vision", ColorVision);
#+END_SRC

**** =<color-contrast>=

***** =<color-contrast>= Implementation

#+BEGIN_SRC js
customElements.define("color-contrast", ColorContrast);
#+END_SRC

**** =<color-illuminant>=

***** =<color-illuminant>= Implementation

#+BEGIN_SRC js
customElements.define("color-illuminant", ColorIlluminant);
#+END_SRC

**** =<color-dict>=

***** =<color-dict>= Implementation

#+BEGIN_SRC js
customElements.define("color-dict", ColorDict);
#+END_SRC

** Library

The DSL of QuarkSuite v2 is brand new and experimental. So we'll want to be extremely careful about how we implement
it. We're going to use vanilla web components because the nature of the DSL is too basic to add the overhead of a
library.

The resource I use to guide the implementation is, of course, the [[https://developer.mozilla.org/en-US/docs/Web/Web_Components][MDN docs on web components]].

Alright, but before we get into how to implement the DSL, I'll need you to understand exactly /what/ we're building.

*** Preamble

The intended goal of the DSL is to work as a direct translation of the core functionality. This means we'll be using web
components a bit differently from the way you'd expect. The crucial bit: the translated actions and emitters need to be
able to access defined values or collections of their respective types.

This leads to four types of elements:

+ ~<x-defn as="" from="" action="">~
+ ~<x-func>~
+ ~<x-token>~
+ ~<x-dict from="">~

The DSL workflow is essentially defining values and collections (=def=) and transforming them.

Let's make this a bit more concrete with an example. Let's say we want to create a color =#bada55= as =brand= and then
format it to rgb before generating a double complementary harmony. Then let's say we want to pass it through a color
vision check for =achromatopsia= so we can adjust for contrast.

Here's that process with the core workflow:

#+BEGIN_SRC js :tangle no
const brand = convert("rgb", "#bad555");
const scheme = harmony({ configuration: "double" }, brand);

const achromatopsia = propagate(preset(vision, { as: "achromatopsia" }), scheme);

// Then render data
#+END_SRC

Here's how it should translate through the DSL:

#+BEGIN_SRC html :tangle no
<!-- Definitions also handle color actions -->
<color-defn as="brand" swatch="#bada55" action="convert" to="rgb"></color-defn>
<color-defn as="scheme" from="brand" action="harmony" configuration="double"></color-defn>

<!-- Functions are for displaying data in various states. Not intended to be used as output -->
<color-vision from="scheme" type="achromatopsia"></color-vision>
#+END_SRC

*** DSL Setup

**** Workspace

Before anything, let's set up a little HTML workspace so we can build and debug.

#+BEGIN_SRC html :tangle "./index.html" :comments link
<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>QuarkSuite v2 DSL Workspace</title>
    <script type="module" src="/color.js"></script>
    <link rel="preconnect" href="https://fonts.googleapis.com" />
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin />
    <link
      href="https://fonts.googleapis.com/css2?family=Roboto+Mono&family=Roboto:ital,wght@0,100;0,300;0,400;0,700;0,900;1,400&display=swap"
      rel="stylesheet"
    />
    <link rel="stylesheet" href="/style.css" />
  </head>
  <body>
    <header>
      <h1>QuarkSuite v2 DSL Workspace</h1>
    </header>
    <main>
      <section>
        <h2>Base Color</h2>
        <color-defn
          as="base"
          swatch="#bada55"
          action="convert"
          to="rgb"
        ></color-defn>
        <color-defn
          as="@base"
          from="base"
          action="adjust"
          chroma="-10"
        ></color-defn>
        <color-defn
          as="brand"
          from="@base"
          action="mix"
          target="dodgerblue"
          strength="40"
        ></color-defn>
      </section>
      <section>
        <h2>Harmony</h2>
        <color-defn
          as="scheme"
          from="brand"
          action="harmony"
          configuration="triadic"
        ></color-defn>
      </section>
      <section>
        <h2>Adjusted Harmony</h2>
        <section>
          <color-defn as="main" from="scheme.0"></color-defn>
          <color-defn
            as="accent"
            from="scheme.1"
            action="adjust"
            lightness="-10"
            chroma="20"
          ></color-defn>
          <color-defn
            as="highlight"
            from="scheme.2"
            action="adjust"
            lightness="10"
            chroma="20"
          ></color-defn>
        </section>
        <section>
          <color-defn
            as="final-scheme"
            from="main accent highlight"
          ></color-defn>
        </section>
      </section>
      <h2>Palette Generation</h2>
      <section>
        <color-dict
          as="ui"
          from="main"
          configuration="artistic"
          contrast="100"
          stated
          action="a11y"
          rating="AA"
          large
          dark
        ></color-dict>
      </section>
    </main>
  </body>
</html>
#+END_SRC

And some basic styling:

#+BEGIN_SRC css :tangle "./style.css" :comments link
:root {
  margin: 0;
  padding: 0;
}

:root:after: {
  box-sizing: border-box;
}

body {
  font-family: Roboto, sans-serif;
}

section {
  display: flex;
  flex-flow: row wrap;
  gap: 1ex;
  flex: 1;
  flex-basis: 100%;
}

h2,
h3,
h4,
h5 {
  flex-basis: 100%;
}

color-defn,
color-vision,
color-contrast,
color-illuminant,
palette-token,
color-dict {
  flex: 1;
  flex-basis: 45ch;
}

color-token {
  --data-family: Roboto, sans-serif;
  --code-family: Roboto Mono, monsopace;
}
#+END_SRC

*** Color
:PROPERTIES:
:header-args:js: :tangle "./lib/color.js" :mkdirp yes :comments link
:END:

**** Color Setup

Since we're developing a translation layer, we'll need to pull in the Core v2 module so we have access to everything
we're converting.

#+BEGIN_SRC js
import {
  delegate,
  pipeline,
  preset,
  process,
  propagate,
} from "https://x.nest.land/quarksuite:core@2.0.0-11/v2/fn.js";
import {
  accessibility,
  adjust,
  contrast,
  convert,
  harmony,
  illuminant,
  mix,
  palette,
  tokens,
  vision,
} from "https://x.nest.land/quarksuite:core@2.0.0-11/v2/color.js";
#+END_SRC

